{
  "date": "2026-02-28",
  "articles": [
    {
      "title": "NASA on ‘aggressive’ schedule to complete SLS repairs for April launch",
      "summary": "\nNASA has about three weeks to complete repairs to the Space Launch System’s upper stage to make the next launch window for the Artemis 2 mission in early April.\nThe post NASA on ‘aggressive’ schedule to complete SLS repairs for April launch appeared first on SpaceNews.",
      "url": "https://spacenews.com/nasa-on-aggressive-schedule-to-complete-sls-repairs-for-april-launch/",
      "site": "SpaceNews",
      "date": "2026-02-28"
    },
    {
      "title": "Firefly Alpha FLTA007 “Stairway to Seven” set for launch from California coast",
      "summary": "Firefly Aerospace is returning its Alpha launch vehicle to flight after a nearly 10-month stand…\nThe post Firefly Alpha FLTA007 “Stairway to Seven” set for launch from California coast appeared first on NASASpaceFlight.com.",
      "url": "https://www.nasaspaceflight.com/2026/02/firefly-flta007-launch/",
      "site": "NASASpaceflight",
      "date": "2026-02-28"
    },
    {
      "title": "NASA Makes a “Course Correction” for the Artemis Program",
      "summary": "NASA Administrator Jared Isaacman revealed a reconfigured plan for the Artemis program today that increases the cadence of launches and adds an earth-orbit test flight before a lunar surface return. […]",
      "url": "https://spacepolicyonline.com/news/nasa-makes-a-course-correction-for-the-artemis-program/",
      "site": "SpacePolicyOnline.com",
      "date": "2026-02-27"
    },
    {
      "title": "Firefly Eyes Late February for Return to Flight",
      "summary": "Following a mishap in April of 2025, Firefly Aerospace is aiming to return its Alpha rocket to launch on the 28th of February.",
      "url": "https://www.spacescout.info/2026/02/firefly-eyes-late-february-for-return-to-flight/",
      "site": "Space Scout",
      "date": "2026-02-27"
    },
    {
      "title": "Harnessing the Sun to Extract Oxygen on the Moon",
      "summary": "Light shines onto a solar concentrator being tested in this Aug. 7, 2025, photo. The concentrator is part of the Carbothermal Reduction Demonstration (CaRD) project, which aims to produce oxygen from simulated lunar regolith for use at the Moon’s south pole. For this test, the team integrated the solar concentrator, mirrors, and software and confirmed […]",
      "url": "https://www.nasa.gov/image-article/harnessing-the-sun-to-extract-oxygen-on-the-moon/",
      "site": "NASA",
      "date": "2026-02-27"
    }
  ]
}