{
  "date": "2026-02-27",
  "articles": [
    {
      "title": "Harnessing the Sun to Extract Oxygen on the Moon",
      "summary": "Light shines onto a solar concentrator being tested in this Aug. 7, 2025, photo. The concentrator is part of the Carbothermal Reduction Demonstration (CaRD) project, which aims to produce oxygen from simulated lunar regolith for use at the Moon’s south pole. For this test, the team integrated the solar concentrator, mirrors, and software and confirmed […]",
      "url": "https://www.nasa.gov/image-article/harnessing-the-sun-to-extract-oxygen-on-the-moon/",
      "site": "NASA",
      "date": "2026-02-27"
    },
    {
      "title": "Hyperion author Dan Simmons dies from stroke at 77",
      "summary": "I went into <em>Hyperion</em> blind, decades ago, knowing almost nothing about it. I was never the same.",
      "url": "https://arstechnica.com/culture/2026/02/hyperion-author-dan-simmons-dies-from-stroke-at-77/",
      "site": "Arstechnica",
      "date": "2026-02-27"
    },
    {
      "title": "NASA announces major overhaul of Artemis moon program:  “We’ve got to get back to basics”",
      "summary": "New NASA Administrator Jared Isaacman announced a major overhaul of the agency's Artemis moon program Friday, acknowledging that the agency's plan to land astronauts on the moon in 2028 was not realistic without another preparatory mission first to lay the groundwork.  ",
      "url": "https://spaceflightnow.com/2026/02/27/nasa-announces-major-overhaul-of-artemis-moon-program/",
      "site": "Spaceflight Now",
      "date": "2026-02-27"
    },
    {
      "title": "NASA’s Home for Experimental Flight Advances Aeronautics Mission",
      "summary": "Nestled in the Mojave Desert, NASA’s Armstrong Flight Research Center in Edwards, California, pushes the boundaries of flight to advance the agency’s aeronautics mission. This is where Chuck Yeager broke the sound barrier and engineers are now pioneering the future of high-speed, autonomous, and electrified aircraft. Armstrong contributes to NASA’s broader mission of innovation and […]",
      "url": "https://www.nasa.gov/centers-and-facilities/armstrong/nasas-home-for-experimental-flight-advances-aeronautics-mission/",
      "site": "NASA",
      "date": "2026-02-27"
    },
    {
      "title": "Flight 12: Ship 39 rolls out to Masseys to begin testing",
      "summary": "After spending a few months in Mega Bay 2 fully stacked, Ship 39 – the…\nThe post Flight 12: Ship 39 rolls out to Masseys to begin testing appeared first on NASASpaceFlight.com.",
      "url": "https://www.nasaspaceflight.com/2026/02/ship-39-masseys-testing/",
      "site": "NASASpaceflight",
      "date": "2026-02-27"
    }
  ]
}