{
  "date": "2026-03-01",
  "articles": [
    {
      "title": "Intuitive Machines raises $175 million in stock sale",
      "summary": "\nIntuitive Machines raised $175 million in a stock sale Feb. 25 and plans to use the proceeds to help build out a deep space communications network.\nThe post Intuitive Machines raises $175 million in stock sale appeared first on SpaceNews.",
      "url": "https://spacenews.com/intuitive-machines-raises-175-million-in-stock-sale/",
      "site": "SpaceNews",
      "date": "2026-03-01"
    },
    {
      "title": "Rocket Lab Showcases Hypersonic Test Flight",
      "summary": "On February 27th, 2026, Rocket Lab launched the “That’s Not A Knife” mission from Wallops Island, Virginia, carrying a hypersonic test vehicle for the Defense Innovation Unit.",
      "url": "https://www.spacescout.info/2026/02/rocket-lab-showcases-hypersonic-test-flight/",
      "site": "Space Scout",
      "date": "2026-02-28"
    },
    {
      "title": "NASA on ‘aggressive’ schedule to complete SLS repairs for April launch",
      "summary": "\nNASA has about three weeks to complete repairs to the Space Launch System’s upper stage to make the next launch window for the Artemis 2 mission in early April.\nThe post NASA on ‘aggressive’ schedule to complete SLS repairs for April launch appeared first on SpaceNews.",
      "url": "https://spacenews.com/nasa-on-aggressive-schedule-to-complete-sls-repairs-for-april-launch/",
      "site": "SpaceNews",
      "date": "2026-02-28"
    },
    {
      "title": "Firefly Alpha FLTA007 “Stairway to Seven” set for launch from California coast",
      "summary": "Firefly Aerospace is returning its Alpha launch vehicle to flight after a nearly 10-month stand…\nThe post Firefly Alpha FLTA007 “Stairway to Seven” set for launch from California coast appeared first on NASASpaceFlight.com.",
      "url": "https://www.nasaspaceflight.com/2026/02/firefly-flta007-launch/",
      "site": "NASASpaceflight",
      "date": "2026-02-28"
    },
    {
      "title": "NASA Makes a “Course Correction” for the Artemis Program",
      "summary": "NASA Administrator Jared Isaacman revealed a reconfigured plan for the Artemis program today that increases the cadence of launches and adds an earth-orbit test flight before a lunar surface return. […]",
      "url": "https://spacepolicyonline.com/news/nasa-makes-a-course-correction-for-the-artemis-program/",
      "site": "SpacePolicyOnline.com",
      "date": "2026-02-27"
    }
  ]
}