{
  "date": "2026-02-27",
  "articles": [
    {
      "title": "China set for its first one-year human spaceflight mission, confirms Pakistani astronaut flight",
      "summary": "\nChina will begin its first one-year duration astronaut mission this year, while the first international astronaut will make a short visit to Tiangong space station.\nThe post China set for its first one-year human spaceflight mission, confirms Pakistani astronaut flight appeared first on SpaceNews.",
      "url": "https://spacenews.com/china-set-for-its-first-one-year-human-spaceflight-mission-confirms-pakistani-astronaut-flight/",
      "site": "SpaceNews",
      "date": "2026-02-27"
    },
    {
      "title": "Earth from Space: Terra Nova Bay, Antarctica",
      "summary": "From the ESA Blogs.",
      "url": "https://www.esa.int/ESA_Multimedia/Images/2026/02/Earth_from_Space_Terra_Nova_Bay_Antarctica",
      "site": "ESA",
      "date": "2026-02-27"
    },
    {
      "title": "ArianeGroup Test Fires Greta Engine and Secures New ESA Contract",
      "summary": "ArianeGroup announced on 25 February that it had successfully completed a months-long test campaign of its Greta rocket engine and secured a European Space Agency contract to continue its development. Greta is an evolution of the Berta rocket engine, which was also developed by ArianeGroup under an ESA Future Launchers Preparatory Programme contract and first […]\nThe post ArianeGroup Test Fires Gr",
      "url": "https://europeanspaceflight.com/arianegroup-test-fires-greta-engine-and-secures-new-esa-contract/",
      "site": "European Spaceflight",
      "date": "2026-02-27"
    },
    {
      "title": "Chesapeake Bay Locked in Ice",
      "summary": "Nearly 50 years ago, the first Landsat satellite captured the rare sight of Mid-Atlantic waterways frozen over.",
      "url": "https://science.nasa.gov/earth/earth-observatory/chesapeake-bay-locked-in-ice/",
      "site": "NASA",
      "date": "2026-02-27"
    },
    {
      "title": "NASA Safety Panel Warns of “High Risk” for Artemis III",
      "summary": "As NASA prepares to launch the Artemis II crew around the Moon in the very near future, the Aerospace Safety Advisory Panel (ASAP) is raising warning flags about the next […]",
      "url": "https://spacepolicyonline.com/news/nasa-safety-panel-warns-of-high-risk-for-artemis-iii/",
      "site": "SpacePolicyOnline.com",
      "date": "2026-02-27"
    }
  ]
}