{
  "date": "2026-02-26",
  "articles": [
    {
      "title": "NASA Names Acting Leaders for Two Key Human Spaceflight Roles",
      "summary": "On Thursday, NASA announced Joel Montalbano will serve as the acting associate administrator for the Space Operations Mission Directorate (SOMD) at NASA Headquarters in Washington, and Dana Hutcherson will serve as the acting program manager of the Commercial Crew Program.  SOMD’s programs and activities include the Commercial Crew Program, the Commercial Low Earth Orbit Program, the Human Researc",
      "url": "https://www.nasa.gov/news-release/nasa-names-acting-leaders-for-two-key-human-spaceflight-roles/",
      "site": "NASA",
      "date": "2026-02-26"
    },
    {
      "title": "A non-public document reveals that science may not be prioritized on next Mars mission",
      "summary": "For some reason, NASA chose not to publicly release its Mars orbiter objectives.",
      "url": "https://arstechnica.com/space/2026/02/a-non-public-document-reveals-that-science-may-not-be-prioritized-on-next-mars-mission/",
      "site": "Arstechnica",
      "date": "2026-02-26"
    },
    {
      "title": "NordSpace founder backs Wyvern with new Canada-focused venture arm",
      "summary": "\nThe founder and sole investor behind Canadian launch startup NordSpace has invested in Earth observation operator Wyvern with a new venture arm focused on advancing Canada’s sovereign space capabilities.\nThe post NordSpace founder backs Wyvern with new Canada-focused venture arm appeared first on SpaceNews.",
      "url": "https://spacenews.com/nordspace-founder-backs-wyvern-with-new-canada-focused-venture-arm/",
      "site": "SpaceNews",
      "date": "2026-02-26"
    },
    {
      "title": "CesiumAstro acquires Vidrovr to embed AI in communications systems",
      "summary": "\nSAN FRANCISCO – CesiumAstro announced the acquisition Feb. 26 of Vidrovr, a startup that specializes in artificial intelligence for multimodal signals analysis. Terms of the transaction, which closed in late 2025, were not disclosed. CesiumAstro acquired Vidrovr to accelerate its campaign to embed AI in space telecommunications and intelligence, surveillance and reconnaissance infrastructure, ena",
      "url": "https://spacenews.com/cesiumastro-acquires-vidrovr-to-embed-ai-in-communications-systems/",
      "site": "SpaceNews",
      "date": "2026-02-26"
    },
    {
      "title": "Phantom Space reclaims former Vector launch technology",
      "summary": "\nRemnants of Vector Launch have made it back to one of its original architects after Phantom Space bought launch assets that were sold off in 2020 during the small rocket developer’s bankruptcy.\nThe post Phantom Space reclaims former Vector launch technology appeared first on SpaceNews.",
      "url": "https://spacenews.com/phantom-space-reclaims-former-vector-launch-technology/",
      "site": "SpaceNews",
      "date": "2026-02-26"
    }
  ]
}