{
  "date": "2026-02-28",
  "articles": [
    {
      "title": "NASA Makes a “Course Correction” for the Artemis Program",
      "summary": "NASA Administrator Jared Isaacman revealed a reconfigured plan for the Artemis program today that increases the cadence of launches and adds an earth-orbit test flight before a lunar surface return. […]",
      "url": "https://spacepolicyonline.com/news/nasa-makes-a-course-correction-for-the-artemis-program/",
      "site": "SpacePolicyOnline.com",
      "date": "2026-02-27"
    },
    {
      "title": "Firefly Eyes Late February for Return to Flight",
      "summary": "Following a mishap in April of 2025, Firefly Aerospace is aiming to return its Alpha rocket to launch on the 28th of February.",
      "url": "https://www.spacescout.info/2026/02/firefly-eyes-late-february-for-return-to-flight/",
      "site": "Space Scout",
      "date": "2026-02-27"
    },
    {
      "title": "Harnessing the Sun to Extract Oxygen on the Moon",
      "summary": "Light shines onto a solar concentrator being tested in this Aug. 7, 2025, photo. The concentrator is part of the Carbothermal Reduction Demonstration (CaRD) project, which aims to produce oxygen from simulated lunar regolith for use at the Moon’s south pole. For this test, the team integrated the solar concentrator, mirrors, and software and confirmed […]",
      "url": "https://www.nasa.gov/image-article/harnessing-the-sun-to-extract-oxygen-on-the-moon/",
      "site": "NASA",
      "date": "2026-02-27"
    },
    {
      "title": "Hyperion author Dan Simmons dies from stroke at 77",
      "summary": "I went into <em>Hyperion</em> blind, decades ago, knowing almost nothing about it. I was never the same.",
      "url": "https://arstechnica.com/culture/2026/02/hyperion-author-dan-simmons-dies-from-stroke-at-77/",
      "site": "Arstechnica",
      "date": "2026-02-27"
    },
    {
      "title": "NASA announces major overhaul of Artemis moon program:  “We’ve got to get back to basics”",
      "summary": "New NASA Administrator Jared Isaacman announced a major overhaul of the agency's Artemis moon program Friday, acknowledging that the agency's plan to land astronauts on the moon in 2028 was not realistic without another preparatory mission first to lay the groundwork.",
      "url": "https://spaceflightnow.com/2026/02/27/nasa-announces-major-overhaul-of-artemis-moon-program/",
      "site": "Spaceflight Now",
      "date": "2026-02-27"
    }
  ]
}